examples/wire_drawing/CFD/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
600
(
(-0.0029825329752564 0.000763215774340325 -1.98800434843325e-21)
(-0.00294753389959144 0.000763061531721719 1.83828156657177e-23)
(-0.00291253483189983 0.000762907308717106 4.31550675460879e-21)
(-0.00287753577245637 0.000762753105339421 1.02856892310103e-21)
(-0.00284253672154854 0.000762598921601665 1.56093316376137e-21)
(-0.00280753767947718 0.000762444757516907 -4.14552763332504e-22)
(-0.00277253864655737 0.000762290613098285 2.17847036952097e-21)
(-0.00273753962311917 0.000762136488359016 -1.64666074017209e-21)
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-0.00298250920728576 0.000915436087080922 -7.51002785915141e-22)
(-0.00294751598024412 0.000913606963783476 7.5250636202983e-22)
(-0.00291252275324928 0.000911777840488477 0)
(-0.00287752952630152 0.000909948717195939 1.8858069950356e-18)
(-0.00284253629940113 0.000908119593905876 -1.8767354584535e-18)
(-0.0028075430725484 0.000906290470618305 0)
(-0.00277254984574362 0.000904461347333241 0)
(-0.00273755661898708 0.000902632224050698 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 6((0.0005 0.000750119014377039 0) (0.0005 0.000751784094064156 1.34382828845216e-21) (0.0005 0.000753449173754289 0) (0.0005 0.000755114253447418 -1.41016510513119e-22) (0.0005 0.000756779333143521 1.41016852971563e-22) (0.0005 0.000758444412842581 1.19224989908647e-21));
    }
    Wire
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-0.0029825 0.0007492861661864 0)
(-0.0029475 0.0007492861661864 0)
(-0.0029125 0.0007492861661864 0)
(-0.0028775 0.0007492861661864 0)
(-0.0028425 0.0007492861661864 0)
(-0.0028075 0.0007492861661864 0)
(-0.0027725 0.0007492861661864 0)
(-0.0027375 0.0007492861661864 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 6((-0.003 0.000763292833567972 0) (-0.003 0.00079113388362118 0) (-0.003 0.00081897513630267 0) (-0.003 0.000846816571622883 0) (-0.003 0.000874658172137882 0) (-0.003 0.000902499922556629 0));
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
