examples/wire_drawing/CFD/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
-0.0029825329752564
-0.00294753389959144
-0.00291253483189983
-0.00287753577245637
-0.00284253672154854
-0.00280753767947718
-0.00277253864655737
-0.00273753962311917
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.00298250920728576
-0.00294751598024412
-0.00291252275324928
-0.00287752952630152
-0.00284253629940113
-0.0028075430725484
-0.00277254984574362
-0.00273755661898708
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0.0005 0.0005 0.0005 0.0005 0.0005 0.0005);
    }
    Wire
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.0029825
-0.0029475
-0.0029125
-0.0028775
-0.0028425
-0.0028075
-0.0027725
-0.0027375
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(-0.003 -0.003 -0.003 -0.003 -0.003 -0.003);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
