examples/wire_drawing/CFD/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
0.000763215774340325
0.000763061531721719
0.000762907308717106
0.000762753105339421
0.000762598921601665
0.000762444757516907
0.000762290613098285
0.000762136488359016
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.000915436087080922
0.000913606963783476
0.000911777840488477
0.000909948717195939
0.000908119593905876
0.000906290470618305
0.000904461347333241
0.000902632224050698
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0.000750119014377039 0.000751784094064156 0.000753449173754289 0.000755114253447418 0.000756779333143521 0.000758444412842581);
    }
    Wire
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0007492861661864
0.0007492861661864
0.0007492861661864
0.0007492861661864
0.0007492861661864
0.0007492861661864
0.0007492861661864
0.0007492861661864
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0.000763292833567972 0.00079113388362118 0.00081897513630267 0.000846816571622883 0.000874658172137882 0.000902499922556629);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
