examples/wire_drawing/CFD/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
-1.98800434843325e-21
1.83828156657177e-23
4.31550675460879e-21
1.02856892310103e-21
1.56093316376137e-21
-4.14552763332504e-22
2.17847036952097e-21
-1.64666074017209e-21
...
)
;

boundaryField
{
    dieWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-7.51002785915141e-22
7.5250636202983e-22
0
1.8858069950356e-18
-1.8767354584535e-18
0
0
0
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0 1.34382828845216e-21 0 -1.41016510513119e-22 1.41016852971563e-22 1.19224989908647e-21);
    }
    Wire
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
