examples/wire_drawing/CFD/constant/pointDisplacementTmp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    dieWall
    {
        type            timeVaryingMappedFixedValue;
	offset		(0 0 0);
	setAverage	off;
        value		uniform (0 0 0);
    }
    outlet
    {
        type            slip;
    }
    inlet
    {
        type            slip;
    }
    Wire
    {
        type            fixedValue;
        value    	nonuniform List<vector> 
202
(( 0.000000000000000e+00 -1.087008031531292e-07  4.745979560578181e-09)
 ( 0.000000000000000e+00 -1.114429432347368e-07  4.865703982128393e-09)
 ( 0.000000000000000e+00 -1.114429432347368e-07 -4.865703982128393e-09)
 ( 0.000000000000000e+00 -1.087008031531292e-07 -4.745979560578181e-09)
 ( 0.000000000000000e+00 -1.164321646428641e-07  5.083538093186564e-09)
 ( 0.000000000000000e+00 -1.164321646428641e-07 -5.083538093186564e-09)
 ( 0.000000000000000e+00 -1.226626800602152e-07  5.355568271114139e-09)
 ( 0.000000000000000e+00 -1.226626800602152e-07 -5.355568271114139e-09)
 ( 0.000000000000000e+00 -1.300519411176971e-07  5.678190376280942e-09)
...
 ( 0.000000000000000e+00 -3.640328882882242e-05 -1.589401915237291e-06));
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
