examples/wire_drawing/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    dieWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1094;
    }
    outlet
    {
        type            patch;
        nFaces          6;
        startFace       1194;
    }
    Wire
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1200;
    }
    inlet
    {
        type            patch;
        nFaces          6;
        startFace       1300;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          600;
        startFace       1306;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          600;
        startFace       1906;
    }
)

// ************************************************************************* //
